import { replaceQmoji } from './core/baixie-replace'

export default [
  {
    id: 'a1',
    text: '以防你不知道，新闻是增量游戏里面最重要的一部分，因为你可以看到作者在制作废话。',
  },
  {
    id: 'a2',
    text: '伟大的news曾经说过：伟大的news曾经说过：伟大的news曾经说过：伟大的news曾经说过：伟大的news曾经说过：伟大的news曾经说过：伟大的news曾经说过：伟大的news曾经说过：伟大的news曾经说过：伟大的news曾经说过：',
  },
  {
    id: 'a3',
    text: '这中间是一条news专属的路，不知道啥时候有绿灯红灯。',
  },
  {
    id: 'a4',
    text: 'àáâãäåæçèéêëēìíîǐïīðñòóõǒôöōøœùúǔûüūýþšÿ',
  },
  {
    id: 'a5',
    text: '此条新闻由于含有R18级内容，已被禁止播出。',
  },
  {
    id: 'a6',
    text: '<$jx><$jx><$jx><$jx><$jx>',
  },
  {
    id: 'a7',
    text: 'We will fly away, far away, 或许会彷徨，或许会受伤<$bx>',
  },
  {
    id: 'a8',
    text: '<$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx>',
  },
  {
    id: 'a9',
    text: '<span class="gunmu">This new will disappear fast because this news has "滚木" which not exists.</span>',
  },
  {
    id: 'a10',
    text: '< 湃 射 > 八 拜 氵身寸 争 霸  拜 连  ア ッ プ：[CENSORED]',
  },
  {
    id: 'a11',
    text: '什么实体，你拿个消防斧不就乱杀了，我特么直接一路砍穿level ！，还用逃跑？',
  },
  {
    id: 'a12',
    text: 'sudo rm -rf /* --no-preserved-root',
  },
  {
    id: 'a13',
    text: 'Je ne sais pas',
  },
  {
    id: 'a14',
    text: 'You have 4.79 replicators. Your replicators is multiplied by 0.23 every second.',
  },
  {
    id: 'a15',
    text: '超大蚂蚁来袭<span style:"font-size: 5em;">🐜🐜🐜🐜🐜</span>',
  },
  {
    id: 'a16',
    text: '我是谁？我从哪来？我又要到哪里去？',
  },
  {
    id: 'a17',
    text: '“还有你把所有代码全写到index.html里面是啥意思” “隔壁ad把全部js代码放两个js文件里 这算什么意思[发怒][发怒]”',
  },
  {
    id: 'a18',
    text: 'Arcaea官网的购买专辑按钮被未知的伟力入侵，点击后竟成某贝者十専网站',
  },
  {
    id: 'a19',
    text: '太过于不平衡，-2',
  },
  {
    id: 'a20',
    text: `les <$bx>s et les ❓s`,
  },
  {
    id: 'a21',
    text: '你奶奶了个三角篓子的，❓❓这个❓❓， 扑腾一下子直接❓❓❓❓，把❓❓❓❓❓❓❓❓❓❓❓裤衩子都给崩飞了，可以说❓了个五马分尸，万朵桃花开呀',
  },
  {
    id: 'a22',
    text: 'Click here to get here',
  },
  {
    id: 'a23',
    text: 'src/news.ts [+]             94,12          Bot',
  },
  {
    id: 'a24',
    text: '衫脚福闻',
  },
  {
    id: 'a25',
    text: "Today's news: Today's news: Today's news: Today's news: Today's news: Today's news: Today's news: Today's news: Today's news: Today's news: Today's news: ",
  },
  {
    id: 'a26',
    text: 'Use void 0 instead of undefined, because you never know is undefined defined',
  },
  {
    id: 'a27',
    text: "you actually did it. what a maniac you are. congratulations. mind blown. -- someone i don't know",
  },
  {
    id: 'a28',
    text: '1. -拜谢是什么意思?   -拜谢的意思.',
  },
  {
    id: 'a29',
    text: '2. -黄豆双手向下拜谢是什么意思? -向你拜谢的意思.',
  },
  {
    id: 'a30',
    text: '3. 拜谢是个可恶的东西. 据说人类看了拜谢就会变的拜谢,天天黄豆双手向下跪地,不知道在拜什么.',
  },
  {
    id: 'a31',
    text: '5. <$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx>/yiw<$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$bx><$fn>',
  },
  {
    id: 'a33',
    text: '7. 有个古文里曾经有一句话: "拜谢帝上", 现在他被增量考古学家认为是拜谢帝的出处.',
  },
  {
    id: 'peitr11',
    text: '8. 拜谢到底是个什么东西?有人认为它是一个QQ表情,在电脑端输入<$bx>就能发送一堆,但我要告诉你,拜谢是个可怕的阴谋.拜谢帝操控拜谢入侵了QQ,并成为一个表情包,每当QQ群友发送这个表情包的时候,拜谢帝的拜谢军团其中就会增加一个<$bx>,最终形成超级拜谢军团,更多的拜谢超级军团演变成了更多颜色的特种拜谢,在自定义表情包中活跃.不过其中最可怕的当属 #猎奇 拜谢, #猎奇 拜谢会污染人的心智.所以 951232913 群禁止了 #猎奇 拜谢,并对发送这种拜谢的群友进行禁言 29d 23h 59min 的处罚.',
  },
  {
    id: 'a35',
    text: '9. 拜谢帝在攻打并入侵QQ的时候被错误识别成了一个表情包,从此QQ就有了<$bx>的表情',
  },
  {
    id: 'a36',
    text: '10. 据说拜谢是从黄豆进化而来的,非常讨厌豆浆.',
  },
  {
    id: 'a38',
    text: '12. 七彩拜谢只不过是拜谢在色素里泡了一会变成的.',
  },
  {
    id: 'a39',
    text: '13. 大型拜谢只不过是小拜谢充了点气变成的.',
  },
  {
    id: 'a40',
    text: '14. 数拜谢: 1个拜谢 2个拜谢 11个拜谢 100个拜谢 101个拜谢 6个拜谢 ... 1.79e308个拜谢 -1.79e308个拜谢',
  },
  {
    id: 'a42',
    text: '16. 你有 这么多 基础拜谢',
  },
  {
    id: 'a43',
    text: '17. 点击这个新闻让你的基础拜谢变成拜谢. *点击后* 权限不足,请给予拜谢帝管理员后生效.',
  },
  {
    id: 'a44',
    text: '18. 据说拜谢增量的最终boss是拜谢帝',
  },
  {
    id: 'a45',
    text: '19. 据说拜谢增量的最终boss是0100000a7',
  },
  {
    id: 'a51',
    text: '25. break_baixie.js是超越了break_infinity.js和break.eternity.js的又一新力作.这个js可以打破表情包数量的限制,而不只是数量的限制.',
  },
  {
    id: 'a53',
    text: '27. 这条新闻睡觉了,做梦梦到了拜谢',
  },
  {
    id: 'a54',
    text: '28. 拜谢和拜谢在拜谢,拜谢嘴里说着拜谢,身体正在拜谢,拜谢正在拜谢拜谢,因为拜谢拜谢是拜谢拜谢拜谢恩情的方式,拜谢继续拜谢拜谢,拜谢也在拜谢拜谢,拜谢拜谢拜谢之后拜谢拜谢拜谢,拜谢拜谢完了,嘴里还喊着拜谢拜谢拜谢拜谢拜谢拜谢.',
  },
  {
    id: 'a55',
    text: '29. n.拜谢 v.拜谢 adj.拜谢 n.拜谢 adv.拜谢 interj.拜谢! 这是一个只有拜谢的句子.',
  },
  {
    id: 'a56',
    text: '30. n.拜谢 conj.拜谢 n.拜谢 v.拜谢 prep.拜谢 adj.拜谢 n.拜谢 adv.拜谢 adv.拜谢 interj.拜谢! 这是一个更长的只有拜谢的句子.',
  },
  {
    id: 'a57',
    text: '事实上，mdvi的新闻包含了a和peitr两个选集。溜溜溜达嘿曾经在5月末试图入侵拜谢增量的新闻系统，组成了30个与拜谢相关的新闻，其中11个混入了peitr相关信息，因此visual选项里有个开启peitr选集新闻的选项，防止玩家被peitr选集里的新闻蛊惑。',
  },
  {
    id: 'peitr1',
    text: '4. rule 拜谢: 拜谢帝活跃在 951232913 群中,不要与他对视,否则你会变成拜谢!',
  },
  {
    id: 'peitr2',
    text: '6. 伟大的溜溜溜达嘿曾经说过: 拜谢由于它可爱的外形和拜的一下还会duang一下很快风靡了增量圈.',
  },
  {
    id: 'peitr3',
    text: '11. rule 拜谢帝: 951232913 群里的拜谢帝是假的,不要相信他说的任何话.',
  },
  {
    id: 'peitr4',
    text: '15. 为什么有给氢气球充氢气之后爆炸氢气球而没有给拜谢充气之后爆炸拜谢?',
  },
  {
    id: 'peitr5',
    text: '20. 拜谢增量的最终boss是谁? 伟大的溜溜溜达嘿曾经说过: 禁止在群里发 龙蛇舟车*此处贴对应的qq表情*,否则开白鞋底盒h, 不难发现,白鞋底指的就是拜谢帝,而拜谢帝能够被溜溜溜达嘿开盒,意味着溜溜溜达嘿比拜谢帝厉害,由此推断,拜谢增量的最终boss应该是溜溜溜达嘿而不是拜谢帝或者0100000a7更不是大黑.',
  },
  {
    id: 'peitr6',
    text: '21. 这条新闻由伟大的溜溜溜达嘿独家冠名向您发送',
  },
  {
    id: 'peitr7',
    text: '22. 拜谢帝和溜溜溜达嘿其实是同学关系,只不过溜溜溜达嘿后来转学了,转到了一个荒山僻岭的鬼地方,还遇到了一堆狗.这堆狗差点把溜溜溜达嘿拉下水了.拜谢帝知道之后,乘坐拜谢列车前去营救溜溜溜达嘿,溜溜溜达嘿得知后,立马跟那群狗溜溜溜达嘿了,之后拜谢帝的拜谢列车把溜溜溜达嘿救了出来,但是溜溜溜达嘿还得回去上学,所以又下地狱了.在此之后,拜谢帝考了期中,溜溜溜达嘿嘲笑拜谢帝班级的数学成绩跟拜谢一样,拜谢帝很生气,在QQ连发了297个<$fn>,发了这么多个<$fn>之后,拜谢帝删除了溜溜溜达嘿的好友,溜溜溜达嘿感到非常难过,从地狱爬了出来,顺着网线找到了拜谢帝家.拜谢帝感到怒不可遏,召唤出了<$bx>和<$fn>的结合体对溜溜溜达嘿进行毁灭式打击,但是溜溜溜达嘿没有还手,只是忏悔着自己的罪行.最后,溜溜溜达嘿成功离开了那群狗,重新和拜谢帝成为了好朋友.',
  },
  {
    id: 'peitr8',
    text: '23. 溜溜溜达嘿和拜谢帝其实是同学关系,只不过溜溜溜达嘿后来转学了,可怜的拜谢帝只能自己偷偷抹眼泪.在得知溜溜溜达嘿身处险境之后,立刻驾驶着拜谢列车前去营救溜溜溜达嘿.拜谢帝把那群狗按在地上打,各种小拜谢把狗打的落花流水.在成功营救溜溜溜达嘿后,拜谢帝和溜溜溜达嘿重新建立了朋友关系,并在QQ上有了好友.只不过在拜谢帝考完期中跟溜溜溜达嘿叙旧的时候,溜溜溜达嘿嘲笑拜谢帝班级的数学成绩离了他就跟拜谢一样,拜谢帝此时怒不可遏,发了297个<$fn>并拉黑了溜溜溜达嘿.可没想到,可恶的溜溜溜达嘿居然从荒山爬到了管道,并通过管道运输到了网络基站,然后顺着网线爬到了拜谢帝的家.拜谢帝是用<$fn>和<$bx>攻击溜溜溜达嘿,溜溜溜达嘿没有还手,向拜谢帝真诚地忏悔了自己犯下的66686个罪行.最后,拜谢帝放下了自己的愤怒,重新和溜溜溜达嘿成为了好朋友.',
  },
  {
    id: 'peitr9',
    text: '24. 溜溜溜达嘿是谁???????????????????????????????????????L?????????????i?????????u??????????????????????????????????????????l??????????i????????????????????????????????????u???????6????????????????????????6???????????????????6?????????????????????????8??????????6?????????????????????????????????????????????答案在问号之中',
  },
  {
    id: 'peitr10',
    text: '26. 0100000a7曾经被溜溜溜达嘿枪了,原因是拖更接力树,他的接力树直到现在都没有动静(已经被传走了),还有Banana3864,著名的graphomata大神,曾经是#7的终极实力,但是他因为拖更接力树被#60的溜溜溜达嘿给杀了,还夺走了他的管理员,现在接力树活动还在如火如荼的进行中,0100000a7和Banana3864成功起到了杀鸡儆猴的作用.',
  },
].map((news) => {
  let newobj = {
    id: news.id,
    text: replaceQmoji(news.text),
  }
  if (news.id.startsWith('peitr'))
    newobj.text = '<span style="color: red">[PEITR-highbinding]</span>' + newobj.text
  return newobj
})
